Tekla.Structures.Drawing.EdgeChamfer.EdgeChamferAttributes
The EdgeChamferAttributes class is the attributes class for the edge chamfer.

Tekla.Structures.Drawing.EdgeChamfer.EdgeChamferAttributes.VisibleLines
The line type of the chamfer.

Tekla.Structures.Drawing.EdgeChamfer.EdgeChamferAttributes.#ctor(System.Boolean)
Creates a new default edge chamfer attributes instance that doesn't load attributes.

Tekla.Structures.Drawing.EdgeChamfer.EdgeChamferAttributes.#ctor
Creates a new default edge chamfer attributes instance that loads standard attributes.

Tekla.Structures.Drawing.EdgeChamfer.EdgeChamferAttributes.#ctor(System.String)
Creates a new edge chamfer attributes instance that loads the specified attributes.
AttributeFile: The filename of the attribute file.

Tekla.Structures.Drawing.EdgeChamfer.EdgeChamferAttributes.LoadAttributes(System.String)
Loads the attributes from the attribute file.
AttributeFile: The filename of the attribute file.
Returns: True if the attributes are loaded correctly. False if the attribute file loading failed.

Tekla.Structures.Drawing.EdgeChamfer.EdgeChamferAttributes.IsEqual(System.Object)
Compares the current object with an object of the same type.
ObjectToCompare: The object to be used for comparing.
Returns: True if all the fields (except for the database GUID) of the objects match.